
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/cocoide/aws-ecs/actions/runs/4289688523)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-00ec53614ec162c10]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04a0e1e6a67e9c9e5]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0706f7119af5cd4c0]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09e0fb9f71f4b1bc1]
aws_security_group.ecs: Refreshing state... [id=sg-03e925085929b2a2a]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:targetgroup/golang-server-target-group/d8ad3df87212743b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c4aade2c33e61df0]
aws_security_group.alb: Refreshing state... [id=sg-02b7bf20624cca338]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-059b2d6513f7016a6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-064b9ce76f2caea7b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f530f2af3d06382]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0671aa01347b05132]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ea504b634a38d765]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02172262f4929ea4a]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0529bf93ccc0ef0ac]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0d09bd6559194d43e]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-970747601]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:loadbalancer/app/golang-server-alb/b4a4f8080b3efb6d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-064b9ce76f2caea7b1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c70654710f5f82e7]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0da0c116dd0f80bd8]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09e0fb9f71f4b1bc11080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c4aade2c33e61df01080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-080f75e69f7af2f8e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a1ea0282dfeb569b]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:listener/app/golang-server-alb/b4a4f8080b3efb6d/6277e5de37148c72]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:listener-rule/app/golang-server-alb/b4a4f8080b3efb6d/6277e5de37148c72/61278361fb6be1ce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "golang-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "golang-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=golang-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=golang-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"a8836f04eaab7211a67ddaecc55d37789d66c976","Vars":{},"WorkflowName":"Terraform"} -->